In [10]:
import pandas as pd
import numpy as np
%matplotlib inline
import matplotlib.pyplot as plt
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

#There are two obvious kinds of sorting  sorting by label and sorting by actual values.

In [11]:
#By Index  The primary method for sorting axis labels (indexes) 
df = pd.DataFrame({'one' : pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
                       'two' : pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
                      'three' : pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})
df

        one     three       two
a -2.557003       NaN -1.474905
b  0.170854  1.168233 -0.410128
c -0.534945  0.545600  0.801420
d       NaN  1.101445  0.209177

In [12]:
df.sort_index()

        one     three       two
a -2.557003       NaN -1.474905
b  0.170854  1.168233 -0.410128
c -0.534945  0.545600  0.801420
d       NaN  1.101445  0.209177

In [13]:
df.sort_index(ascending=False) # 降序

        one     three       two
d       NaN  1.101445  0.209177
c -0.534945  0.545600  0.801420
b  0.170854  1.168233 -0.410128
a -2.557003       NaN -1.474905

In [14]:
###这个里面，axis都是指index多维下的轴，不会操作colum
df.sort_index(ascending=False,axis=0) 
df.sort_index(axis=1)

        one     three       two
d       NaN  1.101445  0.209177
c -0.534945  0.545600  0.801420
b  0.170854  1.168233 -0.410128
a -2.557003       NaN -1.474905

        one     three       two
a -2.557003       NaN -1.474905
b  0.170854  1.168233 -0.410128
c -0.534945  0.545600  0.801420
d       NaN  1.101445  0.209177

In [19]:
#By Values

df1 = pd.DataFrame({'one':[2,1,1,1],'two':[1,3,2,4],'three':[5,4,3,2]})

df1.sort_values(by=['one','two'])

   one  three  two
2    1      3    2
1    1      4    3
3    1      2    4
0    2      5    1

In [21]:
#special treatment of NA values via the na_position argument:
s=df1.one
s[2] = np.nan
s.sort_values()

1    1.0
3    1.0
0    2.0
2    NaN
Name: one, dtype: float64

In [24]:
s.sort_values(na_position='first')

2    NaN
1    1.0
3    1.0
0    2.0
Name: one, dtype: float64